app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title") VALUES (?)  [["title", "Science"]]
---
    def create
        @school_class = SchoolClass.create(params.require(:school_class).permit(:title))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Life Science"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class = SchoolClass.update(params.require(:school_class).permit(:title))