app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Faith"], ["last_name", "Caraaa"], ["created_at", "2021-05-16 01:35:57.034456"], ["updated_at", "2021-05-16 01:35:57.034456"]]
---
    def create
        #byebug
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jackie"], ["last_name", "Birdee"], ["updated_at", "2021-05-16 01:41:41.068386"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student = Student.update(params.require(:student).permit(:first_name, :last_name))